docs/meeting_notes/2020-05-08.tex
% Created 2020-05-08 vr 14:41
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage[a4paper, total={7in, 9in}]{geometry}
\author{Wiebe-Marten Wijnja and Jiři Kosinka}
\date{2020-06-08}
\title{Notes of video-meeting wrapping up SPP and beginning Bachelor's Project}
\hypersetup{
 pdfauthor={Wiebe-Marten Wijnja and Jiři Kosinka},
 pdftitle={Notes of video-meeting wrapping up SPP and beginning Bachelor's Project},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle


\section{Short Programming Project}
\label{sec:org920b62b}
\subsection{Wrapping up the SPP}
\label{sec:orgf156ee3}
\subsubsection{Presentation}
\label{sec:org2d52582}

The group still meets (digitally?) every two weeks, so presentation is possible.

\begin{itemize}
\item about 15 minutes
\item with slides
\end{itemize}

\subsection{Turning the SPP into a paper}
\label{sec:orgff4f63e}
\emph{thorough notes about this are in the shared OverLeaf document}.

\begin{itemize}
\item Sections should be balanced
\end{itemize}

\section{Bachelor's Project}
\label{sec:org5293e88}
\subsection{Theme}
\label{sec:org6833ba4}
Visualizing Iterated Function Systems when zooming in.

\subsubsection{Ideas:}
\label{sec:org86f2887}
Two ideas W-M has:

\begin{enumerate}
\item Render points using 'chaos game' in 2D point-cloud
\label{sec:orga4b4c97}
These points can then be re-used between frames.
Goal: less work per rendered frame and thus faster speeds.

\item Move zoomed-in camera to shallower viewport that is identical because of self-similarity
\label{sec:orgccf2714}
Goal: Keeping the camera from zooming in too far, which allows us to keep re-using points.
\end{enumerate}

\subsection{Suggestions by Jiři}
\label{sec:org49cfda1}
\subsubsection{Maybe investigate 'IFS flattening'?}
\label{sec:orgf005aea}
Turning multiple layers of transformations into a single (wider) layer of transformations
in a 'preparation' step before running e.g. the chaos game.

\subsubsection{Point cloud splatting}
\label{sec:org45e7abb}
It might make sense to look into how modern GPUs do (3D) point-cloud rendering
because that might be of use to how to efficiently do 2D point-cloud rendering.

\subsection{Formalities}
\label{sec:org3a9b6b4}
\subsubsection{Info}
\label{sec:org1c06ad1}
\begin{itemize}
\item The bachelor's project takes roughly 10-12 weeks full-time.
\item The starting form can be found in Nestor.
\item After 6 weeks there is a formal 'midterm review' (with separate form).
\end{itemize}

\subsubsection{Decisions}
\label{sec:org58322c6}

W-M will start with the project next week, and therefore try to finish around week 32 (beginning of August).

\subsubsection{Second Supervisor}
\label{sec:org75d7dea}

Jiři will ask PhD-student Gerben Hettinga. Hope he says yes!
\end{document}